Exercicio/app/controllers/clients_controller.rb

INSERT INTO "clients" ("address", "created_at", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "meu address"], ["created_at", Fri, 16 Mar 2012 20:32:58 UTC +00:00], ["name", "lelele"], ["phone", "(19) 9122-5263"], ["updated_at", Fri, 16 Mar 2012 20:32:58 UTC +00:00]]
---
  def create
    @client = Client.new(params[:client])
    if(@client.save)