Exercicio/app/controllers/orders_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."client_id" = 1
---
  def index
    @client = Client.find(params[:client_id])
    @orders = @client.orders

INSERT INTO "orders" ("amount", "client_id", "created_at", "date", "product_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 2], ["client_id", 1], ["created_at", Fri, 16 Mar 2012 20:34:36 UTC +00:00], ["date", Fri, 16 Mar 2012], ["product_id", 1], ["updated_at", Fri, 16 Mar 2012 20:34:36 UTC +00:00]]
---
  def create
    @order = Order.new(params[:order])
    @order.client_id = params[:client_id]
    if(@order.save)