Exercicio/app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 16 Mar 2012 20:33:52 UTC +00:00], ["description", "verde"], ["name", "vassoura"], ["price", 14.0], ["updated_at", Fri, 16 Mar 2012 20:33:52 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])
    if(@product.save)