Exercicio/app/views/orders/_form.html.haml

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
---
        %td
          = Client.find(params[:client_id])

SELECT "products".* FROM "products"
---
        %td
          = f.select :product_id, Product.all.collect { |product| [ product.name, product.id ] }